app/Helpers/general_helper.php

function sistem()
{
    $db      = db_connect();
    $query = $db->table('manajemen_sistem')->get();
---
SELECT *
FROM `manajemen_sistem`