app/Controllers/AuthController.php

SELECT *
FROM `users`
WHERE `username` = 'ade@gmail.com'
OR `email` = 'ade@gmail.com'
 LIMIT 1
---
    public function login(){
        if ($this->request->isAJAX()) {

            $validasi = $this->validate([
                'email_username' => [
                    'rules' => 'required',
                    'errors' => [
                        'required' => 'Email atau username harus di isi'
                    ]
                ],
                'password' => [
                    'rules' => 'required',
                    'errors' => [
                        'required' => 'Password harus di isi',
                    ]
                ],
            ]);

            if (!$validasi) {
                $msg = [
                    'error' => [
                        'email_username' => $this->validation->getError('email_username'),
                        'password' => $this->validation->getError('password'),
                    ]
                ];
            } else {
                $email_username = $this->request->getVar('email_username');
                $password = $this->request->getVar('password');
                $data = $this->usersModel->where('username', $email_username)->orWhere('email', $email_username)->first();