app/Controllers/SistemController.php

    public function index()
    {
        $data = [
            'title' => 'Manajemen Sistem',
            'active' => 'manajemen_sistem',
            'js' => 'sistem.js',
            'sistem' => $this->db->table('manajemen_sistem')->get()->getFirstRow('array'),
---
SELECT *
FROM `manajemen_sistem`

    public function save_logo_favicon()
    {
        if ($this->request->isAJAX()) {
            $tipe = $this->request->getVar('tipe');
            $id_sistem = decrypt_url($this->request->getVar('id'));
            $sistem = $this->db->table('manajemen_sistem')->getWhere(['id' => $id_sistem])->getRowArray();
---
SELECT *
FROM `manajemen_sistem`
WHERE `id` = '1'