app/Controllers/UsersController.php

SELECT *
FROM `users`
WHERE `users`.`id` = '6'
---
    public function edit()
    {
        if ($this->request->isAjax()) {
            $id = decrypt_url($this->request->getVar('id'));
            $users = $this->usersModel->find($id);

SELECT *
FROM `users`
WHERE `users`.`id` = '6'
---
    public function update()
    {
        if ($this->request->isAJAX()) {
            $id = decrypt_url($this->request->getVar('id'));
            $old_data = $this->usersModel->find($id);

UPDATE `users` SET `nama` = 'Ade Rahman', `username` = 'jabrik3111@gmail.com', `email` = 'aderahman9908@gmail.com', `telepon` = '085366125569', `password` = '$2y$10$SDvuN7bWOEPBHxF7DvhZ7.99tPiCCYmk8erljsJdloz8JvLhgjMLm', `hak_akses` = 'admin', `status` = 'aktif', `foto` = 'default.png', `updated_at` = '2022-08-27 01:54:51'
WHERE `users`.`id` IN ('6')
---
                    'foto' => $filename,
                    'updated_at' => date('Y-m-d H:i:s'),
                ];
                $this->usersModel->update($id, $data);

SELECT *
FROM `users`
WHERE `users`.`id` = '7'
---
            } else {
                $id = decrypt_url($this->request->getVar('id'));
                $password_lama = $this->request->getVar('password_lama');
                $data = $this->usersModel->find($id);